In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [19]:
df=pd.read_csv('Homeprice_Prediction.csv')
pd.set_option('display.max_rows', df.shape[0] + 1)
df

    area  bedroom  age          price
0   6000        5   30  913690.516649
1   3500        2   19  598916.668555
2   4200        6   50  670732.643058
3   2100       10   28  600054.829282
4   3400        4   32  592475.851704
5   5000        6   28  831480.390602
6   2000        2   21  424359.569824
7   2600        3   50  421266.095717
8   4100        3   46  602286.630265
9   4500        5    8  816694.647726
10  3900        4   18  693751.123396
11  6200        4   10  977348.483132
12  4390        6   12  814829.787555

In [3]:
df.shape

(13, 4)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   area     13 non-null     int64
 1   bedroom  13 non-null     int64
 2   age      13 non-null     int64
 3   price    13 non-null     float64
dtypes: float64(1), int64(3)
memory usage: 544.0 bytes

In [5]:
from sklearn.model_selection import train_test_split

In [6]:
X = df.drop('price', axis = 1)
X

    area  bedroom  age
0   6000        5   30
1   3500        2   19
2   4200        6   50
3   2100       10   28
4   3400        4   32
5   5000        6   28
6   2000        2   21
7   2600        3   50
8   4100        3   46
9   4500        5    8
10  3900        4   18
11  6200        4   10
12  4390        6   12

In [7]:
y = df['price']
y

0     913690.516649
1     598916.668555
2     670732.643058
3     600054.829282
4     592475.851704
5     831480.390602
6     424359.569824
7     421266.095717
8     602286.630265
9     816694.647726
10    693751.123396
11    977348.483132
12    814829.787555
Name: price, dtype: float64

In [8]:
X_train, X_test, y_train, y_test = train_test_split(X, y, train_size = 0.8)
X_train

    area  bedroom  age
4   3400        4   32
2   4200        6   50
10  3900        4   18
9   4500        5    8
6   2000        2   21
1   3500        2   19
0   6000        5   30
12  4390        6   12
5   5000        6   28
7   2600        3   50

In [9]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X_train)

X_train = scaler.transform(X_train)
X_test = scaler.transform(X_test)

In [10]:
from sklearn.neighbors import KNeighborsRegressor

regressor = KNeighborsRegressor(n_neighbors = 5)
regressor.fit(X_train, y_train)

KNeighborsRegressor()

In [11]:
y_predict = regressor.predict(X_test)
y_predict

array([595428.47648609, 745242.66412911, 814089.29318561])

In [12]:
y_test

8     602286.630265
3     600054.829282
11    977348.483132
Name: price, dtype: float64

In [13]:
import math

In [14]:
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score

In [15]:
rmse = math.sqrt(mean_squared_error(y_test,y_predict))
rmse

126201.03639688955

In [16]:
r2_score(y_test, y_predict)

0.49354521912161053

In [17]:
regressor.predict([[3000, 4, 40]])

array([809485.59711806])